Revit 2025 API
NurbSpline.CtrlPoints Property
Returns the control points of the nurb spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public IList<XYZ> CtrlPoints { get; }
Public ReadOnly Property CtrlPoints As IList(Of XYZ)
	Get
public:
property IList<XYZ^>^ CtrlPoints {
	IList<XYZ^>^ get ();
}
member CtrlPoints : IList<XYZ> with get
Property Value
IList<XYZ>
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace